Ret640/bulk/kOmegaSST/kay/Pr0.71/mesh2/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

omegaValue 100;

internalField   uniform $omegaValue;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type        omegaWallFunction;
        value       uniform     $omegaValue;
    }
    top
    {
        type        omegaWallFunction;
        value       uniform     $omegaValue;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
